Revit 2027 API
TableCellStyleOverrideOptions.HorizontalAlignment Property
 Indicates if the horizontal alignment characteristic is overridden.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HorizontalAlignment { get; set; }
Public Property HorizontalAlignment As Boolean
	Get
	Set
public:
property bool HorizontalAlignment {
	bool get ();
	void set (bool value);
}
member HorizontalAlignment : bool with get, set
Property Value
Boolean
See Also
Reference
TableCellStyleOverrideOptions Class
Autodesk.Revit.DB Namespace